[
  {
    "1st_stage_label": "Applied computing",
    "2nd_stage_label": "Arts and humanities",
    "description 1": "Application of computing technologies to support disciplines such as literature, music, history, and philosophy, including digital humanities and cultural heritage preservation.",
    "description 2": "Utilization of computational methods to analyze and interpret human culture, enabling new forms of scholarly inquiry in fields like linguistics, art history, and philosophy.",
    "description 3": "Development of digital tools and platforms to facilitate the creation, preservation, and dissemination of artistic and humanistic works.",
    "description 4": "Integration of multimedia technologies to enhance the study and appreciation of the arts and humanities.",
    "description 5": "Use of virtual and augmented reality to create immersive experiences for exploring historical events and cultural artifacts.",
    "description 6": "Application of text mining and natural language processing to analyze literary texts and historical documents.",
    "description 7": "Development of interactive educational software to teach concepts in arts and humanities.",
    "description 8": "Implementation of digital archives and databases for preserving cultural heritage.",
    "description 9": "Use of computational modeling to simulate historical events and cultural phenomena.",
    "description 10": "Integration of social media analytics to study contemporary cultural trends.",
    "id": "00"
  },
  {
    "1st_stage_label": "Applied computing",
    "2nd_stage_label": "Computers in other domains",
    "description 1": "Application of computing in various fields like agriculture, astronomy, earth sciences, and other non-traditional areas, facilitating domain-specific problem-solving.",
    "description 2": "Development of specialized software and hardware solutions tailored to the unique requirements of diverse industries and scientific disciplines.",
    "description 3": "Integration of computational models and simulations to advance research and operations in sectors such as environmental science and healthcare.",
    "description 4": "Implementation of data analytics and machine learning techniques to extract insights from domain-specific datasets.",
    "description 5": "Use of embedded systems and IoT devices to monitor and control processes in fields like manufacturing and transportation.",
    "description 6": "Application of virtual reality for training and simulation in specialized domains.",
    "description 7": "Development of decision support systems for complex problem-solving in various industries.",
    "description 8": "Integration of geographic information systems (GIS) for spatial analysis in fields like urban planning and agriculture.",
    "description 9": "Use of computational tools in legal analysis and forensic investigations.",
    "description 10": "Application of computing in sports analytics to enhance performance and strategy.",
    "id": "01"
    
  },
  {
    "1st_stage_label": "Applied computing",
    "2nd_stage_label": "Document management and text processing",
    "description 1": "Development and utilization of systems for managing, retrieving, and processing textual documents, including natural language processing and information retrieval techniques.",
    "description 2": "Implementation of document management systems (DMS) to store, share, track, and manage electronic documents.",
    "description 3": "Use of version control systems to maintain document history and facilitate collaborative editing.",
    "description 4": "Application of optical character recognition (OCR) to digitize and process scanned documents.",
    "description 5": "Integration of metadata and indexing to enhance document search and retrieval capabilities.",
    "description 6": "Development of automated text summarization tools to extract key information from large documents.",
    "description 7": "Use of sentiment analysis to interpret the emotional tone of textual content.",
    "description 8": "Implementation of content management systems (CMS) for organizing and publishing digital content.",
    "description 9": "Application of machine translation technologies to convert text between languages.",
    "description 10": "Use of plagiarism detection software to ensure the originality of textual content.",
    "id": "02"
  },
  {
    "1st_stage_label": "Applied computing",
    "2nd_stage_label": "Education",
    "description 1": "Integration of computing technologies to enhance learning experiences, including e-learning platforms, educational software, and virtual classrooms.",
    "description 2": "Development of adaptive learning systems that personalize educational content based on student performance.",
    "description 3": "Use of learning management systems (LMS) to organize and deliver educational materials.",
    "description 4": "Application of gamification techniques to increase student engagement and motivation.",
    "description 5": "Implementation of virtual and augmented reality tools to create immersive learning environments.",
    "description 6": "Use of data analytics to monitor student progress and inform instructional strategies.",
    "description 7": "Development of online assessment tools to evaluate student learning outcomes.",
    "description 8": "Integration of collaborative tools to facilitate group learning and peer interaction.",
    "description 9": "Application of natural language processing to develop intelligent tutoring systems.",
    "description 10": "Use of educational simulations to provide experiential learning opportunities.",
    "id": "03"
  },
  {
    "1st_stage_label": "Applied computing",
    "2nd_stage_label": "Electronic commerce",
    "description 1": "Application of computing in online business transactions, encompassing online retailing, electronic payment systems, and digital marketplaces.",
    "description 2": "Development of secure payment gateways to facilitate online financial transactions.",
    "description 3": "Use of recommendation systems to personalize shopping experiences for customers.",
    "description 4": "Implementation of inventory management systems to optimize stock levels and supply chains.",
    "description 5": "Integration of customer relationship management (CRM) tools to enhance customer service and retention.",
    "description 6": "Application of data analytics to understand consumer behavior and inform marketing strategies.",
    "description 7": "Use of mobile commerce (m-commerce) platforms to enable shopping via mobile devices.",
    "description 8": "Development of chatbots and virtual assistants to provide customer support.",
    "description 9": "Implementation of fraud detection systems to protect against unauthorized transactions.",
    "description 10": "Use of blockchain technology to ensure transparency and security in online transactions.",
    "id": "04"
  },
  {
    "1st_stage_label": "Applied computing",
    "2nd_stage_label": "Enterprise computing",
    "description 1": "Development and deployment of computing solutions within organizations to support business processes, including enterprise resource planning and customer relationship management systems.",
    "description 2": "Implementation of cloud computing services to enhance scalability and flexibility in enterprise IT infrastructure.",
    "description 3": "Integration of enterprise applications to streamline operations across various departments within an organization.",
    "description 4": "Utilization of big data analytics to inform strategic decision-making and improve business outcomes.",
    "description 5": "Deployment of cybersecurity measures to protect enterprise data and ensure compliance with regulatory standards.",
    "description 6": "Adoption of virtualization technologies to optimize resource utilization and reduce operational costs.",
    "description 7": "Development of mobile enterprise applications to support a remote and mobile workforce.",
    "description 8": "Integration of artificial intelligence and machine learning to automate processes and enhance productivity.",
    "description 9": "Implementation of disaster recovery and business continuity plans to maintain operations during unforeseen events.",
    "description 10": "Use of collaborative tools and platforms to facilitate communication and collaboration among employees.",
    "id": "05"
  },
  {
    "1st_stage_label": "Computer systems organization",
    "2nd_stage_label": "Architectures",
    "description 1": "Design and analysis of computer system structures, including instruction set architectures and microarchitectures.",
    "description 2": "Development of parallel and distributed architectures to enhance computational performance and scalability.",
    "description 3": "Exploration of heterogeneous computing architectures combining CPUs, GPUs, and other accelerators.",
    "description 4": "Implementation of energy-efficient architectures for mobile and embedded systems.",
    "description 5": "Investigation of fault-tolerant architectures to ensure system reliability and availability.",
    "description 6": "Design of reconfigurable architectures using technologies like FPGAs for adaptable computing solutions.",
    "description 7": "Study of memory hierarchies and cache architectures to optimize data access and processing speed.",
    "description 8": "Development of interconnection networks and communication protocols within multicore and multiprocessor systems.",
    "description 9": "Analysis of instruction-level parallelism and techniques like pipelining and superscalar execution.",
    "description 10": "Evaluation of architectural trade-offs in terms of performance, power consumption, and cost.",
    "id": "10"
  },
  {
    "1st_stage_label": "Computer systems organization",
    "2nd_stage_label": "Embedded and cyber-physical systems",
    "description 1": "Design and integration of computing systems within physical processes, enabling real-time monitoring and control.",
    "description 2": "Development of embedded systems for applications like automotive control, medical devices, and industrial automation.",
    "description 3": "Implementation of real-time operating systems to manage time-critical tasks in embedded environments.",
    "description 4": "Exploration of sensor networks and data acquisition systems for environmental and structural monitoring.",
    "description 5": "Design of low-power embedded systems to extend battery life in portable and remote devices.",
    "description 6": "Integration of hardware and software components to achieve deterministic behavior in cyber-physical systems.",
    "description 7": "Development of safety-critical systems adhering to stringent reliability and certification standards.",
    "description 8": "Application of model-based design techniques for system specification, simulation, and verification.",
    "description 9": "Implementation of communication protocols for interoperability among embedded devices.",
    "description 10": "Investigation of security measures to protect embedded and cyber-physical systems from threats.",
    "id": "11"
  },
  {
    "1st_stage_label": "Computer systems organization",
    "2nd_stage_label": "Real-time systems",
    "description 1": "Design and analysis of systems that must respond to inputs or events within strict timing constraints.",
    "description 2": "Development of scheduling algorithms to ensure timely execution of tasks in real-time environments.",
    "description 3": "Implementation of real-time operating systems supporting predictable task management and resource allocation.",
    "description 4": "Exploration of hard and soft real-time systems, balancing determinism and flexibility.",
    "description 5": "Integration of real-time systems in applications like avionics, robotics, and multimedia processing.",
    "description 6": "Analysis of latency, jitter, and throughput to evaluate real-time system performance.",
    "description 7": "Development of fault-tolerant mechanisms to maintain system functionality under adverse conditions.",
    "description 8": "Application of formal methods to verify timing correctness and system reliability.",
    "description 9": "Implementation of resource management strategies to handle contention and priority inversion.",
    "description 10": "Investigation of real-time communication protocols for synchronized data exchange.",
    "id": "12"
  },
  {
    "1st_stage_label": "Computer systems organization",
    "2nd_stage_label": "Dependable and fault-tolerant systems and networks",
    "description 1": "Design of systems capable of continuing operation despite the presence of faults or errors.",
    "description 2": "Implementation of redundancy techniques, such as replication and voting, to enhance system reliability.",
    "description 3": "Development of error detection and correction mechanisms to maintain data integrity.",
    "description 4": "Analysis of system availability, maintainability, and safety in critical applications.",
    "description 5": "Integration of fault-tolerant architectures in distributed and networked systems.",
    "description 6": "Application of formal verification methods to ensure system correctness under fault conditions.",
    "description 7": "Investigation of fault models and failure modes to guide system design and testing.",
    "description 8": "Development of self-healing systems that can detect and recover from faults autonomously.",
    "description 9": "Implementation of checkpointing and rollback strategies for fault recovery.",
    "description 10": "Evaluation of trade-offs between system performance and fault tolerance.",
    "id": "13"
  },
  {
    "1st_stage_label": "Computing methodologies",
    "2nd_stage_label": "Artificial intelligence",
    "description 1": "Development of algorithms enabling machines to perform tasks requiring human intelligence.",
    "description 2": "Implementation of natural language processing techniques for understanding and generating human language.",
    "description 3": "Design of expert systems that emulate decision-making abilities of human experts.",
    "description 4": "Application of computer vision methods for interpreting visual information.",
    "description 5": "Integration of robotics with AI for autonomous navigation and task execution.",
    "description 6": "Utilization of reinforcement learning for decision-making in dynamic environments.",
    "description 7": "Development of intelligent agents capable of perceiving and acting upon their environment.",
    "description 8": "Exploration of ethical considerations in AI deployment and usage.",
    "description 9": "Implementation of AI in healthcare for diagnostics and personalized treatment plans.",
    "description 10": "Advancement of AI in finance for fraud detection and algorithmic trading.",
    "id": "14"
  },
  {
    "1st_stage_label": "Computing methodologies",
    "2nd_stage_label": "Parallel computing methodologies",
    "description 1": "Design of systems that perform multiple computations simultaneously to solve complex problems more efficiently.",
    "description 2": "Implementation of data parallelism, where the same operation is performed concurrently on elements of a data set.",
    "description 3": "Utilization of task parallelism to execute different tasks or functions concurrently across multiple processors.",
    "description 4": "Development of shared memory architectures allowing multiple processors to access common memory spaces.",
    "description 5": "Application of distributed memory systems where each processor has its own local memory, communicating via message passing.",
    "description 6": "Integration of hybrid models combining shared and distributed memory approaches for optimized performance.",
    "description 7": "Employment of the fork-join model to parallelize tasks by dividing them into subtasks that are processed in parallel and then joined.",
    "description 8": "Optimization of parallel algorithms to minimize communication overhead and maximize speedup.",
    "description 9": "Implementation of synchronization mechanisms to coordinate parallel processes and prevent race conditions.",
    "description 10": "Evaluation of parallel computing performance using metrics like scalability, efficiency, and load balancing.",
    "id": "15"
  },
  {
    "1st_stage_label": "Computing methodologies",
    "2nd_stage_label": "Symbolic and algebraic manipulation",
    "description 1": "Development of algorithms for exact computation with mathematical expressions, avoiding numerical approximations.",
    "description 2": "Implementation of computer algebra systems (CAS) capable of performing symbolic integration and differentiation.",
    "description 3": "Design of methods for simplifying complex algebraic expressions and solving symbolic equations.",
    "description 4": "Utilization of symbolic computation in solving systems of linear and nonlinear equations.",
    "description 5": "Application of algebraic manipulation in automated theorem proving and formal verification.",
    "description 6": "Integration of symbolic methods in modeling and simulating physical systems with exact parameters.",
    "description 7": "Development of algorithms for manipulating polynomials, including factorization and expansion.",
    "description 8": "Employment of symbolic techniques in cryptographic algorithm design and analysis.",
    "description 9": "Exploration of symbolic methods in differential equations for analytical solutions.",
    "description 10": "Advancement of symbolic computation tools for educational purposes in mathematics and engineering.",
    "id": "16"
  },
  {
    "1st_stage_label": "Computing methodologies",
    "2nd_stage_label": "Distributed computing methodologies",
    "description 1": "Design of systems where processing is distributed across multiple nodes.",
    "description 2": "Implementation of client-server architectures for resource sharing.",
    "description 3": "Development of distributed algorithms for coordination and consensus.",
    "description 4": "Utilization of middleware to facilitate communication between components.",
    "description 5": "Application of distributed file systems for data storage and access.",
    "description 6": "Integration of fault tolerance mechanisms to ensure system reliability.",
    "description 7": "Exploration of scalability strategies in distributed environments.",
    "description 8": "Development of security protocols for distributed systems.",
    "description 9": "Analysis of latency and throughput in distributed computing.",
    "description 10": "Implementation of load balancing techniques across distributed nodes.",
    "id": "17"
  },
  {
    "1st_stage_label": "Computing methodologies",
    "2nd_stage_label": "Machine learning",
    "description 1": "Development of algorithms that enable systems to learn from data.",
    "description 2": "Implementation of supervised learning models for classification tasks.",
    "description 3": "Utilization of unsupervised learning for data clustering and pattern discovery.",
    "description 4": "Application of reinforcement learning for decision-making processes.",
    "description 5": "Integration of deep learning techniques for complex pattern recognition.",
    "description 6": "Development of feature selection and extraction methods.",
    "description 7": "Evaluation of model performance using cross-validation techniques.",
    "description 8": "Optimization of algorithms for scalability and efficiency.",
    "description 9": "Application of machine learning in natural language processing.",
    "description 10": "Exploration of ethical considerations in machine learning applications.",
    "id": "18"
  },
  {
    "1st_stage_label": "Computing methodologies",
    "2nd_stage_label": "Modeling and simulation",
    "description 1": "Creation of abstract models to represent real-world systems.",
    "description 2": "Implementation of simulation techniques to predict system behavior.",
    "description 3": "Utilization of discrete-event simulation for process analysis.",
    "description 4": "Application of continuous simulation in engineering and physics.",
    "description 5": "Integration of agent-based modeling for complex system interactions.",
    "description 6": "Development of simulation software for training and education.",
    "description 7": "Analysis of simulation results for decision support.",
    "description 8": "Optimization of models for computational efficiency.",
    "description 9": "Validation and verification of simulation models.",
    "description 10": "Application of modeling and simulation in policy analysis.",
    "id": "19"
  },
  {
    "1st_stage_label": "General and reference",
    "2nd_stage_label": "Cross-computing tools and techniques",
    "description 1": "Development of performance evaluation tools applicable across various computing systems.",
    "description 2": "Implementation of benchmarking frameworks to assess system efficiency and scalability.",
    "description 3": "Design of profiling tools for analyzing software behavior in different environments.",
    "description 4": "Creation of simulation models to predict system performance under diverse conditions.",
    "description 5": "Utilization of visualization techniques for interpreting complex computational data.",
    "description 6": "Integration of cross-platform debugging tools to streamline software development.",
    "description 7": "Application of standardized testing methodologies to ensure software reliability.",
    "description 8": "Development of collaborative platforms for sharing computational tools and resources.",
    "description 9": "Implementation of version control systems to manage changes across computing projects.",
    "description 10": "Exploration of reproducibility practices to validate computational research findings.",
    "id": "20"
  },
  {
    "1st_stage_label": "General and reference",
    "2nd_stage_label": "Document types",
    "description 1": "Creation of technical specifications detailing system architecture and design.",
    "description 2": "Development of user manuals guiding end-users on software functionalities.",
    "description 3": "Preparation of API documentation for developers integrating software components.",
    "description 4": "Compilation of release notes summarizing updates and bug fixes in software versions.",
    "description 5": "Drafting of test plans outlining procedures for software validation.",
    "description 6": "Generation of installation guides providing step-by-step setup instructions.",
    "description 7": "Maintenance of code comments and inline documentation for code clarity.",
    "description 8": "Creation of training materials to educate users on software applications.",
    "description 9": "Documentation of troubleshooting guides to assist in resolving common issues.",
    "description 10": "Development of compliance documents ensuring adherence to industry standards.",
    "id": "21"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Communication hardware, interfaces and storage",
    "description 1": "Design and development of network interface cards (NICs) for facilitating computer network connections.",
    "description 2": "Implementation of wireless communication modules, such as Wi-Fi and Bluetooth, for enabling wireless data transmission.",
    "description 3": "Development of routers and switches to manage and direct network traffic efficiently.",
    "description 4": "Creation of storage devices, including hard drives and solid-state drives, for data retention and retrieval.",
    "description 5": "Integration of communication protocols into hardware for standardized data exchange.",
    "description 6": "Design of hardware interfaces like USB and HDMI for peripheral connectivity.",
    "description 7": "Development of modems for converting digital data to analog signals and vice versa.",
    "description 8": "Implementation of error detection and correction mechanisms in communication hardware.",
    "description 9": "Optimization of data transfer rates and latency in storage and communication devices.",
    "description 10": "Ensuring compatibility and interoperability among various communication hardware components.",
    "id": "30"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Electronic design automation",
    "description 1": "Development of software tools for automating the design of electronic systems.",
    "description 2": "Implementation of simulation tools to model and analyze circuit behavior before physical prototyping.",
    "description 3": "Creation of layout editors for designing the physical placement of components on a chip.",
    "description 4": "Integration of verification tools to ensure design correctness and functionality.",
    "description 5": "Utilization of synthesis tools to convert high-level design descriptions into gate-level representations.",
    "description 6": "Development of timing analysis tools to assess and optimize circuit performance.",
    "description 7": "Application of design rule checking to ensure compliance with manufacturing constraints.",
    "description 8": "Incorporation of power analysis tools to evaluate and reduce power consumption.",
    "description 9": "Facilitation of collaborative design environments for team-based hardware development.",
    "description 10": "Advancement of EDA tools to support emerging technologies and complex system designs.",
    "id": "31"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Emerging technologies",
    "description 1": "Exploration of quantum computing hardware for solving complex computational problems.",
    "description 2": "Development of neuromorphic chips that mimic neural networks for efficient processing.",
    "description 3": "Investigation into spintronics for data storage and transfer using electron spin.",
    "description 4": "Creation of flexible electronics for wearable and bendable devices.",
    "description 5": "Advancement of photonic circuits for high-speed data transmission using light.",
    "description 6": "Integration of 3D printing techniques in hardware prototyping and manufacturing.",
    "description 7": "Development of bio-integrated electronics for medical monitoring and diagnostics.",
    "description 8": "Research into energy-harvesting devices for self-powered electronics.",
    "description 9": "Implementation of carbon nanotube transistors for enhanced performance.",
    "description 10": "Investigation of topological insulators for novel electronic applications.",
    "id": "32"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Hardware test",
    "description 1": "Design of test benches for validating hardware functionality.",
    "description 2": "Implementation of automated test equipment (ATE) for efficient testing processes.",
    "description 3": "Development of boundary scan techniques for testing interconnections.",
    "description 4": "Application of built-in self-test (BIST) mechanisms for on-chip testing.",
    "description 5": "Utilization of fault injection methods to assess hardware robustness.",
    "description 6": "Execution of stress testing to evaluate hardware under extreme conditions.",
    "description 7": "Integration of test point insertion for improved observability.",
    "description 8": "Analysis of test coverage to ensure comprehensive evaluation.",
    "description 9": "Development of diagnostic tools for identifying and locating faults.",
    "description 10": "Optimization of test procedures to reduce time and cost.",
    "id": "33"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Hardware validation",
    "description 1": "Verification of hardware designs against specifications and requirements.",
    "description 2": "Implementation of simulation models to predict hardware behavior.",
    "description 3": "Development of emulation platforms for real-time validation.",
    "description 4": "Application of formal methods to mathematically prove design correctness.",
    "description 5": "Execution of timing analysis to ensure performance criteria are met.",
    "description 6": "Integration of power analysis to validate energy efficiency.",
    "description 7": "Assessment of thermal characteristics to prevent overheating.",
    "description 8": "Evaluation of electromagnetic compatibility to avoid interference.",
    "description 9": "Conducting compliance testing to adhere to industry standards.",
    "description 10": "Documentation of validation results for certification and quality assurance.",
    "id": "34"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Integrated circuits",
    "description 1": "Design of microchips integrating multiple electronic components on a single substrate.",
    "description 2": "Development of analog ICs for processing continuous signals.",
    "description 3": "Creation of digital ICs for handling discrete signals in computing applications.",
    "description 4": "Integration of mixed-signal ICs combining analog and digital functionalities.",
    "description 5": "Advancement of system-on-chip (SoC) designs for compact and efficient systems.",
    "description 6": "Implementation of application-specific integrated circuits (ASICs) for tailored solutions.",
    "description 7": "Utilization of field-programmable gate arrays (FPGAs) for reconfigurable hardware.",
    "description 8": "Optimization of IC layouts for performance and manufacturability.",
    "description 9": "Application of low-power design techniques in IC development.",
    "description 10": "Exploration of new materials and fabrication technologies for next-generation ICs.",
    "id": "35"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Power and energy",
    "description 1": "Implementation of dynamic voltage and frequency scaling (DVFS) to adjust power consumption based on workload demands.",
    "description 2": "Utilization of power gating techniques to shut off power to inactive circuit blocks, reducing leakage power.",
    "description 3": "Application of clock gating to disable the clock signal in idle modules, minimizing dynamic power dissipation.",
    "description 4": "Design of energy-efficient circuits operating at sub-threshold voltages for ultra-low-power applications.",
    "description 5": "Integration of adaptive voltage scaling (AVS) to dynamically adjust supply voltage in response to performance requirements.",
    "description 6": "Development of energy-harvesting systems that convert ambient energy sources into usable electrical power.",
    "description 7": "Optimization of thermal management strategies, including advanced cooling techniques, to enhance energy efficiency.",
    "description 8": "Implementation of low-power design methodologies in integrated circuits to extend battery life in portable devices.",
    "description 9": "Exploration of reversible computing principles to reduce energy dissipation during computation.",
    "description 10": "Adoption of near-threshold voltage operation in processors to achieve significant power savings.",
    "id": "36"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Robustness",
    "description 1": "Design of fault-tolerant systems capable of maintaining functionality despite hardware failures.",
    "description 2": "Implementation of error detection and correction mechanisms to ensure data integrity.",
    "description 3": "Development of redundant architectures to provide backup in case of component failures.",
    "description 4": "Application of robust programming techniques to handle unexpected inputs and conditions gracefully.",
    "description 5": "Integration of watchdog timers to detect and recover from system malfunctions.",
    "description 6": "Utilization of formal verification methods to mathematically prove system correctness.",
    "description 7": "Conducting rigorous testing procedures, including stress and boundary testing, to identify potential weaknesses.",
    "description 8": "Designing systems with electromagnetic compatibility to prevent interference and ensure reliable operation.",
    "description 9": "Incorporation of thermal management solutions to prevent overheating and maintain performance.",
    "description 10": "Development of self-healing systems that can detect and correct faults autonomously.",
    "id": "37"
  },
  {
    "1st_stage_label": "Hardware",
    "2nd_stage_label": "Very large scale integration design",
    "description 1": "Design of integrated circuits (ICs) that incorporate millions or billions of transistors onto a single chip.",
    "description 2": "Implementation of hierarchical design methodologies to manage the complexity of VLSI systems.",
    "description 3": "Utilization of electronic design automation (EDA) tools for efficient layout and verification of VLSI circuits.",
    "description 4": "Application of low-power design techniques, such as multi-threshold CMOS and dynamic voltage scaling, to reduce energy consumption.",
    "description 5": "Integration of system-on-chip (SoC) architectures to combine multiple functionalities into a single IC.",
    "description 6": "Development of advanced fabrication processes to achieve smaller feature sizes and higher transistor densities.",
    "description 7": "Design of high-speed interconnects to facilitate rapid data transfer within VLSI systems.",
    "description 8": "Incorporation of error detection and correction mechanisms to enhance reliability in densely packed circuits.",
    "description 9": "Optimization of floorplanning and placement strategies to minimize signal delay and power consumption.",
    "description 10": "Exploration of emerging technologies, such as 3D integration and nanotechnology, to push the boundaries of VLSI design.",
    "id": "38"
  },
  {
    "1st_stage_label": "Human-centered computing",
    "2nd_stage_label": "Accessibility",
    "description 1": "Voice-controlled assistants (e.g., Siri, Alexa) enabling hands-free device interaction.",
    "description 2": "Screen readers like JAWS and NVDA assisting visually impaired users in navigating digital content.",
    "description 3": "Closed captioning and real-time transcription services for individuals with hearing impairments.",
    "description 4": "Dynamic haptic displays providing tactile feedback for users with visual impairments.",
    "description 5": "Eye-tracking technology allowing users with mobility challenges to control interfaces.",
    "description 6": "Speech-to-text applications facilitating communication for those with speech difficulties.",
    "description 7": "High-contrast and customizable text settings enhancing readability for users with visual challenges.",
    "description 8": "Alternative input devices like sip-and-puff systems for users with limited motor control.",
    "description 9": "Accessible web design practices ensuring content is navigable via keyboard-only inputs.",
    "description 10": "AI-driven tools that adapt interfaces based on individual user needs and preferences.",
    "id": "40"
  },
  {
    "1st_stage_label": "Human-centered computing",
    "2nd_stage_label": "Collaborative and social computing",
    "description 1": "Real-time document collaboration platforms like Google Docs and Microsoft SharePoint.",
    "description 2": "Online forums and communities facilitating knowledge sharing and support.",
    "description 3": "Social media platforms enabling user-generated content and interactions.",
    "description 4": "Crowdsourcing platforms like Wikipedia allowing collective content creation.",
    "description 5": "Reputation systems in marketplaces (e.g., eBay, Airbnb) fostering trust among users.",
    "description 6": "Collaborative filtering algorithms powering personalized recommendations.",
    "description 7": "Version control systems like Git supporting collaborative software development.",
    "description 8": "Virtual meeting tools (e.g., Zoom, Teams) facilitating remote collaboration.",
    "description 9": "Shared task management applications like Trello and Asana coordinating group efforts.",
    "description 10": "Online co-creation platforms enabling joint design and innovation activities.",
    "id": "41"
  },
  {
    "1st_stage_label": "Human-centered computing",
    "2nd_stage_label": "Human computer interaction (HCI)",
    "description 1": "Touchscreen interfaces on smartphones and tablets.",
    "description 2": "Voice recognition systems enabling hands-free control.",
    "description 3": "Gesture-based controls in gaming consoles and VR systems.",
    "description 4": "Wearable devices like smartwatches providing seamless interaction.",
    "description 5": "Augmented reality applications overlaying digital information onto the physical world.",
    "description 6": "Brain-computer interfaces translating neural signals into commands.",
    "description 7": "Multimodal interfaces combining voice, touch, and visual inputs.",
    "description 8": "Adaptive interfaces that adjust based on user behavior and preferences.",
    "description 9": "Natural language processing enabling conversational interactions with systems.",
    "description 10": "Haptic feedback mechanisms enhancing user immersion and control.",
    "id": "42"
  },
  {
    "1st_stage_label": "Human-centered computing",
    "2nd_stage_label": "Interaction design",
    "description 1": "Swipe gestures for navigation in mobile applications.",
    "description 2": "Pull-to-refresh functionality updating content feeds.",
    "description 3": "Pinch-to-zoom interactions for image and map scaling.",
    "description 4": "Double-tap actions for liking content on social media platforms.",
    "description 5": "Shake-to-undo features in mobile devices.",
    "description 6": "Animated transitions providing visual feedback during navigation.",
    "description 7": "Progress indicators showing task completion status.",
    "description 8": "Contextual menus offering relevant options based on user actions.",
    "description 9": "Drag-and-drop interfaces facilitating intuitive content organization.",
    "description 10": "Responsive design ensuring usability across various device sizes.",
    "id": "43"
  },
  {
    "1st_stage_label": "Human-centered computing",
    "2nd_stage_label": "Ubiquitous and mobile computing",
    "description 1": "Smartphones providing constant access to information and communication tools.",
    "description 2": "Wearable fitness trackers monitoring health metrics in real-time.",
    "description 3": "Smart home devices automating household functions.",
    "description 4": "Location-based services offering personalized recommendations.",
    "description 5": "Mobile payment systems facilitating transactions on-the-go.",
    "description 6": "Cloud computing enabling data access from any device.",
    "description 7": "Augmented reality applications enhancing real-world experiences.",
    "description 8": "Context-aware applications adapting to user environments.",
    "description 9": "Mobile health applications supporting remote patient monitoring.",
    "description 10": "Vehicle infotainment systems integrating navigation and entertainment features.",
    "id": "44"
  },
  {
    "1st_stage_label": "Human-centered computing",
    "2nd_stage_label": "Visualization",
    "description 1": "Interactive dashboards displaying real-time data analytics.",
    "description 2": "Heatmaps visualizing user interaction patterns on websites.",
    "description 3": "Infographics conveying complex information succinctly.",
    "description 4": "Geospatial maps illustrating location-based data trends.",
    "description 5": "Tree diagrams representing hierarchical relationships.",
    "description 6": "Scatter plots identifying correlations between variables.",
    "description 7": "Time-series graphs tracking changes over periods.",
    "description 8": "3D visualizations modeling physical structures or data sets.",
    "description 9": "Network diagrams mapping connections between entities.",
    "description 10": "Storytelling visualizations guiding users through data narratives.",
    "id": "45"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network algorithms",
    "description 1": "Design and analysis of algorithms for efficient data routing and transmission in networks.",
    "description 2": "Implementation of shortest path algorithms, such as Dijkstra's and Bellman-Ford, to determine optimal routing paths.",
    "description 3": "Development of spanning tree algorithms to prevent loops and ensure efficient broadcasting.",
    "description 4": "Application of flow algorithms, like the Ford-Fulkerson method, to optimize network throughput.",
    "description 5": "Utilization of scheduling algorithms to manage data packet transmission and reduce congestion.",
    "description 6": "Design of load balancing algorithms to distribute network traffic evenly across resources.",
    "description 7": "Implementation of congestion control algorithms, such as TCP's Nagle algorithm, to enhance network performance.",
    "description 8": "Development of algorithms for network topology discovery and maintenance.",
    "description 9": "Application of security algorithms to protect data integrity and confidentiality during transmission.",
    "description 10": "Integration of machine learning algorithms to predict network behavior and optimize performance dynamically.",
    "id": "50"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network architectures",
    "description 1": "Design and analysis of network structures, including layered models and protocol stacks.",
    "description 2": "Development of scalable architectures to support growing network demands.",
    "description 3": "Implementation of hybrid network architectures combining different technologies.",
    "description 4": "Exploration of software-defined networking (SDN) for flexible network management.",
    "description 5": "Design of network virtualization techniques to optimize resource utilization.",
    "description 6": "Investigation of content-centric networking for efficient data distribution.",
    "description 7": "Development of energy-efficient network architectures for sustainable operations.",
    "description 8": "Analysis of fault-tolerant designs to ensure network reliability.",
    "description 9": "Integration of cloud and edge computing in network architectures.",
    "description 10": "Evaluation of performance metrics to assess architectural effectiveness.",
    "id": "51"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network protocols",
    "description 1": "Design and implementation of communication protocols governing data exchange.",
    "description 2": "Development of routing protocols to determine optimal data paths.",
    "description 3": "Analysis of transport protocols ensuring reliable data transmission.",
    "description 4": "Exploration of application-layer protocols for specific services.",
    "description 5": "Investigation of protocol security mechanisms to protect data integrity.",
    "description 6": "Optimization of protocol performance under varying network conditions.",
    "description 7": "Implementation of congestion control strategies within protocols.",
    "description 8": "Study of protocol interoperability across diverse systems.",
    "description 9": "Development of lightweight protocols for resource-constrained environments.",
    "description 10": "Evaluation of protocol scalability to accommodate network growth.",
    "id": "52"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network components",
    "description 1": "Design and functionality of hardware elements like routers and switches.",
    "description 2": "Development of network interface cards for efficient data handling.",
    "description 3": "Implementation of firewalls to enforce security policies.",
    "description 4": "Exploration of load balancers for traffic distribution.",
    "description 5": "Integration of wireless access points for mobile connectivity.",
    "description 6": "Analysis of signal repeaters to extend network reach.",
    "description 7": "Development of network monitoring tools for performance assessment.",
    "description 8": "Study of caching mechanisms to enhance data retrieval.",
    "description 9": "Implementation of gateways for protocol translation.",
    "description 10": "Evaluation of component reliability and maintenance requirements.",
    "id": "53"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network types",
    "description 1": "Classification and characteristics of local area networks (LANs).",
    "description 2": "Design and deployment of wide area networks (WANs) for long-distance communication.",
    "description 3": "Implementation of metropolitan area networks (MANs) for city-wide coverage.",
    "description 4": "Exploration of personal area networks (PANs) for individual device connectivity.",
    "description 5": "Development of wireless networks, including Wi-Fi and cellular systems.",
    "description 6": "Analysis of ad hoc networks formed dynamically without fixed infrastructure.",
    "description 7": "Study of sensor networks for environmental monitoring.",
    "description 8": "Implementation of satellite networks for global coverage.",
    "description 9": "Investigation of virtual private networks (VPNs) for secure remote access.",
    "description 10": "Evaluation of hybrid networks combining multiple types for versatility.",
    "id": "54"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network performance evaluation",
    "description 1": "Measurement of throughput to assess data transfer efficiency.",
    "description 2": "Analysis of latency and its impact on user experience.",
    "description 3": "Evaluation of jitter in real-time communication scenarios.",
    "description 4": "Assessment of packet loss rates and their causes.",
    "description 5": "Development of benchmarking tools for performance testing.",
    "description 6": "Implementation of simulation models to predict network behavior.",
    "description 7": "Study of quality of service (QoS) parameters for service differentiation.",
    "description 8": "Monitoring of network availability and uptime statistics.",
    "description 9": "Investigation of performance bottlenecks and optimization strategies.",
    "description 10": "Comparison of performance across different network configurations.",
    "id": "55"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network services",
    "description 1": "Design and implementation of naming and addressing schemes for efficient resource identification.",
    "description 2": "Development of cloud computing services enabling scalable and on-demand resource access.",
    "description 3": "Integration of location-based services providing context-aware information to users.",
    "description 4": "Implementation of programmable networks allowing dynamic control over network behavior.",
    "description 5": "Deployment of in-network processing techniques to optimize data handling and reduce latency.",
    "description 6": "Development of network management tools for monitoring and configuring network operations.",
    "description 7": "Implementation of network monitoring systems to detect and diagnose performance issues.",
    "description 8": "Provision of multicast services for efficient data distribution to multiple recipients.",
    "description 9": "Development of service discovery protocols facilitating automatic detection of network services.",
    "description 10": "Integration of quality of service (QoS) mechanisms to ensure service reliability and performance.",
    "id": "56"
  },
  {
    "1st_stage_label": "Networks",
    "2nd_stage_label": "Network properties",
    "description 1": "Analysis of network security measures to protect against unauthorized access and attacks.",
    "description 2": "Study of network range classifications, from short-range to very long-range networks.",
    "description 3": "Examination of network structure, including physical and logical topologies.",
    "description 4": "Investigation of network dynamics, focusing on changes in topology and traffic patterns.",
    "description 5": "Assessment of network reliability through fault tolerance and redundancy strategies.",
    "description 6": "Evaluation of network mobility support for seamless connectivity in dynamic environments.",
    "description 7": "Implementation of network manageability practices for efficient administration and maintenance.",
    "description 8": "Development of privacy and anonymity protocols to protect user data and identity.",
    "description 9": "Study of scalability aspects to ensure network performance under increasing loads.",
    "description 10": "Analysis of interoperability to facilitate communication between diverse network systems.",
    "id": "57"
  }
]