[
  {
    "1st_stage_label": "Information systems",
    "2nd_stage_label": "Data management systems",
    "description 1": "Exploration of database management systems (DBMS) functionalities, including data definition, manipulation, and control languages.",
    "description 2": "Study of relational database management systems (RDBMS) and their use of table structures and key relationships for data organization.",
    "description 3": "Analysis of NoSQL databases in handling large-scale unstructured data across distributed systems.",
    "description 4": "Investigation into data modeling techniques, such as entity-relationship models, for effective database design.",
    "description 5": "Examination of transaction processing mechanisms ensuring data consistency and integrity.",
    "description 6": "Discussion on ACID properties (Atomicity, Consistency, Isolation, Durability) in maintaining reliable database transactions.",
    "description 7": "Research on data warehousing architectures supporting analytical processing and decision-making.",
    "description 8": "Evaluation of data lakes for storing and managing vast amounts of raw data in various formats.",
    "description 9": "Study of ETL (Extract, Transform, Load) processes in integrating and preparing data for analysis.",
    "description 10": "Analysis of metadata management practices in enhancing data governance and quality control.",
    "id": "60"
  },
  {
    "1st_stage_label": "Information systems",
    "2nd_stage_label": "Information retrieval",
    "description 1": "Development of algorithms for efficient indexing and retrieval of textual information from large datasets.",
    "description 2": "Research on vector space models and their application in ranking document relevance.",
    "description 3": "Investigation into natural language processing techniques for improving search query understanding.",
    "description 4": "Study of relevance feedback mechanisms to refine search results based on user interactions.",
    "description 5": "Analysis of cross-lingual information retrieval methods enabling searches across different languages.",
    "description 6": "Exploration of semantic search technologies that interpret user intent and contextual meaning.",
    "description 7": "Evaluation of information retrieval systems in multimedia contexts, including image and video search.",
    "description 8": "Research on personalized search engines that adapt results based on user behavior and preferences.",
    "description 9": "Study of information retrieval in social media platforms, focusing on real-time data extraction.",
    "description 10": "Investigation into the use of machine learning models to enhance information retrieval accuracy.",
    "id": "61"
  },
  {
    "1st_stage_label": "Information systems",
    "2nd_stage_label": "Information storage systems",
    "description 1": "Study of traditional storage architectures, including hierarchical storage management systems.",
    "description 2": "Research on solid-state drives (SSDs) and their impact on data access speeds and reliability.",
    "description 3": "Investigation into cloud-based storage solutions offering scalable and on-demand data access.",
    "description 4": "Analysis of redundant array of independent disks (RAID) configurations for data redundancy and performance.",
    "description 5": "Exploration of object storage systems designed for handling large volumes of unstructured data.",
    "description 6": "Study of distributed file systems enabling data storage across multiple networked computers.",
    "description 7": "Research on archival storage technologies, such as magnetic tape and optical discs, for long-term data preservation.",
    "description 8": "Investigation into data deduplication techniques to optimize storage efficiency.",
    "description 9": "Analysis of storage virtualization methods that abstract physical storage resources for flexible management.",
    "description 10": "Study of emerging storage technologies, including DNA-based and glass-based data storage solutions.",
    "id": "62"
  },
  {
    "1st_stage_label": "Information systems",
    "2nd_stage_label": "Information systems applications",
    "description 1": "Examination of enterprise resource planning (ERP) systems integrating core business processes.",
    "description 2": "Study of customer relationship management (CRM) systems enhancing client interactions and satisfaction.",
    "description 3": "Research on supply chain management (SCM) systems optimizing logistics and inventory control.",
    "description 4": "Analysis of health information systems (HIS) improving patient care and medical data management.",
    "description 5": "Investigation into financial information systems supporting budgeting, accounting, and financial reporting.",
    "description 6": "Study of human resource information systems (HRIS) streamlining employee data and payroll processing.",
    "description 7": "Research on decision support systems (DSS) aiding complex decision-making through data analysis.",
    "description 8": "Analysis of geographic information systems (GIS) for spatial data visualization and analysis.",
    "description 9": "Exploration of educational information systems facilitating e-learning and academic administration.",
    "description 10": "Study of e-commerce platforms integrating information systems for online transactions and customer service.",
    "id": "63"
  },
  {
    "1st_stage_label": "Information systems",
    "2nd_stage_label": "World Wide Web",
    "description 1": "Study of web protocols, including HTTP and HTTPS, enabling data communication over the internet.",
    "description 2": "Research on web development technologies, such as HTML, CSS, and JavaScript, for creating interactive websites.",
    "description 3": "Investigation into web accessibility standards ensuring inclusive access for users with disabilities.",
    "description 4": "Analysis of search engine optimization (SEO) techniques improving website visibility in search results.",
    "description 5": "Exploration of web analytics tools tracking user behavior and website performance metrics.",
    "description 6": "Study of content management systems (CMS) facilitating website content creation and management.",
    "description 7": "Research on web security measures protecting against threats like phishing and cross-site scripting (XSS).",
    "description 8": "Investigation into semantic web technologies enabling data sharing and reuse across applications.",
    "description 9": "Analysis of responsive web design approaches ensuring optimal viewing across various devices.",
    "description 10": "Study of the evolution of web standards and their impact on modern web application development.",
    "id": "64"
  },
  {
    "1st_stage_label": "Mathematics of computing",
    "2nd_stage_label": "Continuous mathematics",
    "description 1": "Application of differential equations in modeling dynamic systems within computer simulations.",
    "description 2": "Utilization of calculus in analyzing algorithms' performance and computational complexity.",
    "description 3": "Implementation of real analysis techniques in verifying the correctness of numerical algorithms.",
    "description 4": "Study of continuous optimization methods for machine learning model training.",
    "description 5": "Exploration of Fourier analysis in signal processing and image compression.",
    "description 6": "Application of linear algebra in computer graphics transformations and rendering.",
    "description 7": "Use of continuous probability distributions in modeling stochastic processes.",
    "description 8": "Integration of control theory in the development of autonomous systems.",
    "description 9": "Employment of numerical methods for solving partial differential equations in simulations.",
    "description 10": "Analysis of continuous-time Markov chains in performance modeling of systems.",
    "id": "70"
  },
  {
    "1st_stage_label": "Mathematics of computing",
    "2nd_stage_label": "Discrete mathematics",
    "description 1": "Study of graph theory applications in network topology and shortest path algorithms.",
    "description 2": "Utilization of combinatorics in analyzing algorithmic complexity and data structures.",
    "description 3": "Application of set theory in database query optimization and relational algebra.",
    "description 4": "Exploration of number theory in cryptographic algorithm development.",
    "description 5": "Implementation of logic and Boolean algebra in digital circuit design.",
    "description 6": "Analysis of recurrence relations in evaluating recursive algorithm performance.",
    "description 7": "Study of finite automata in lexical analysis and compiler design.",
    "description 8": "Use of discrete probability in randomized algorithms and probabilistic analysis.",
    "description 9": "Application of lattice theory in formal concept analysis and data mining.",
    "description 10": "Investigation of discrete structures in modeling computer networks and protocols.",
    "id": "71"
  },
  {
    "1st_stage_label": "Mathematics of computing",
    "2nd_stage_label": "Information theory",
    "description 1": "Study of entropy as a measure of information content in communication systems.",
    "description 2": "Application of Shannon's theorem in determining channel capacity and error rates.",
    "description 3": "Utilization of coding theory in designing error-detecting and error-correcting codes.",
    "description 4": "Analysis of mutual information in evaluating dependencies between variables.",
    "description 5": "Implementation of data compression algorithms based on information redundancy.",
    "description 6": "Exploration of rate-distortion theory in lossy data compression techniques.",
    "description 7": "Study of information-theoretic security measures in cryptographic protocols.",
    "description 8": "Application of source coding in efficient data representation and transmission.",
    "description 9": "Investigation of channel coding strategies for reliable data communication.",
    "description 10": "Use of information divergence metrics in statistical inference and machine learning.",
    "id": "72"
  },
  {
    "1st_stage_label": "Mathematics of computing",
    "2nd_stage_label": "Mathematical analysis",
    "description 1": "Application of real analysis in the convergence analysis of numerical methods.",
    "description 2": "Study of complex analysis in evaluating integrals and solving differential equations.",
    "description 3": "Utilization of functional analysis in understanding infinite-dimensional vector spaces.",
    "description 4": "Analysis of measure theory in probability theory and stochastic processes.",
    "description 5": "Implementation of calculus of variations in optimizing functionals in physics simulations.",
    "description 6": "Exploration of harmonic analysis in signal processing and image reconstruction.",
    "description 7": "Study of asymptotic analysis in evaluating algorithm efficiency.",
    "description 8": "Application of spectral theory in solving linear operator equations.",
    "description 9": "Investigation of Sobolev spaces in partial differential equation solutions.",
    "description 10": "Use of numerical integration techniques in approximating definite integrals.",
    "id": "73"
  },
  {
    "1st_stage_label": "Mathematics of computing",
    "2nd_stage_label": "Mathematical software",
    "description 1": "Development of computer algebra systems for symbolic mathematical computations.",
    "description 2": "Implementation of numerical analysis libraries for scientific computing applications.",
    "description 3": "Creation of visualization tools for graphing mathematical functions and data.",
    "description 4": "Integration of mathematical modeling software in engineering simulations.",
    "description 5": "Utilization of statistical software packages for data analysis and hypothesis testing.",
    "description 6": "Development of optimization solvers for linear and nonlinear programming problems.",
    "description 7": "Implementation of finite element analysis software for structural engineering.",
    "description 8": "Creation of educational software for teaching mathematical concepts interactively.",
    "description 9": "Integration of mathematical libraries in machine learning frameworks.",
    "description 10": "Development of software for automated theorem proving and formal verification.",
    "id": "74"
  },
  {
    "1st_stage_label": "Mathematics of computing",
    "2nd_stage_label": "Probability and statistics",
    "description 1": "Application of probability theory in modeling random processes and events.",
    "description 2": "Utilization of statistical inference in estimating population parameters from samples.",
    "description 3": "Study of Bayesian statistics in updating beliefs based on new evidence.",
    "description 4": "Implementation of hypothesis testing in determining statistical significance.",
    "description 5": "Analysis of stochastic processes in queueing theory and network traffic modeling.",
    "description 6": "Use of regression analysis in modeling relationships between variables.",
    "description 7": "Application of Markov chains in modeling state transitions in systems.",
    "description 8": "Exploration of Monte Carlo methods in numerical integration and simulation.",
    "description 9": "Study of time series analysis in forecasting and signal processing.",
    "description 10": "Implementation of statistical quality control in manufacturing processes.",
    "id": "75"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Cryptography",
    "description 1": "Study of symmetric encryption algorithms for secure data transmission.",
    "description 2": "Application of public-key cryptography in secure communication protocols.",
    "description 3": "Implementation of digital signatures for authentication and data integrity.",
    "description 4": "Analysis of cryptographic hash functions in data verification processes.",
    "description 5": "Exploration of cryptographic protocols in secure multi-party computations.",
    "description 6": "Development of post-quantum cryptographic algorithms to resist quantum attacks.",
    "description 7": "Utilization of elliptic curve cryptography for efficient key exchange.",
    "description 8": "Study of homomorphic encryption for privacy-preserving computations.",
    "description 9": "Implementation of zero-knowledge proofs in identity verification systems.",
    "description 10": "Analysis of cryptographic key management practices in cloud environments.",
    "id": "80"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Database and storage security",
    "description 1": "Implementation of encryption techniques to protect data at rest in databases.",
    "description 2": "Application of access control mechanisms to restrict unauthorized data access.",
    "description 3": "Utilization of data masking to anonymize sensitive information in storage systems.",
    "description 4": "Development of intrusion detection systems to monitor database activities.",
    "description 5": "Study of database auditing methods to track and analyze access patterns.",
    "description 6": "Implementation of backup and disaster recovery strategies to safeguard data integrity.",
    "description 7": "Application of data integrity checks to ensure the accuracy and consistency of stored information.",
    "description 8": "Utilization of secure database architectures to mitigate vulnerabilities.",
    "description 9": "Development of database firewalls to prevent unauthorized SQL queries.",
    "description 10": "Study of compliance standards and regulations impacting database security practices.",
    "id": "81"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Formal methods and theory of security",
    "description 1": "Application of formal verification techniques to validate security protocols.",
    "description 2": "Utilization of model checking to analyze the correctness of cryptographic algorithms.",
    "description 3": "Study of security properties using temporal logic and automata theory.",
    "description 4": "Development of formal models to represent and analyze attack scenarios.",
    "description 5": "Implementation of theorem proving methods to ensure the reliability of security systems.",
    "description 6": "Application of abstract interpretation in analyzing security vulnerabilities.",
    "description 7": "Study of security protocols using process algebra and bisimulation techniques.",
    "description 8": "Utilization of symbolic execution to detect security flaws in software.",
    "description 9": "Development of secure multi-party computation protocols using formal methods.",
    "description 10": "Application of game theory to model and analyze adversarial behavior in security contexts.",
    "id": "82"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Human and societal aspects of security and privacy",
    "description 1": "Study of user behavior and its impact on cybersecurity practices.",
    "description 2": "Analysis of privacy concerns in social media platforms and their implications.",
    "description 3": "Development of user-centric security models to enhance adoption and compliance.",
    "description 4": "Examination of cultural differences in perceptions of privacy and security.",
    "description 5": "Investigation of ethical considerations in data collection and usage.",
    "description 6": "Study of public awareness campaigns and their effectiveness in promoting cybersecurity.",
    "description 7": "Analysis of legal frameworks governing data protection and privacy rights.",
    "description 8": "Examination of the role of trust in online transactions and digital services.",
    "description 9": "Study of the impact of cybersecurity incidents on public perception and behavior.",
    "description 10": "Development of educational programs to improve cybersecurity literacy among the public.",
    "id": "83"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Intrusion/anomaly detection and malware mitigation",
    "description 1": "Development of machine learning models to detect anomalous network traffic patterns.",
    "description 2": "Application of signature-based detection methods to identify known malware threats.",
    "description 3": "Utilization of behavior-based analysis to detect zero-day attacks.",
    "description 4": "Implementation of sandboxing techniques to analyze suspicious files in isolation.",
    "description 5": "Study of intrusion detection systems using statistical and probabilistic models.",
    "description 6": "Development of real-time monitoring tools to detect and respond to security incidents.",
    "description 7": "Application of honeypots to attract and analyze malicious activities.",
    "description 8": "Utilization of threat intelligence feeds to enhance detection capabilities.",
    "description 9": "Study of malware reverse engineering techniques to understand attack mechanisms.",
    "description 10": "Development of automated response systems to mitigate the impact of detected threats.",
    "id": "84"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Network security",
    "description 1": "Implementation of firewalls to control incoming and outgoing network traffic.",
    "description 2": "Application of intrusion prevention systems to detect and block malicious activities.",
    "description 3": "Utilization of virtual private networks to secure remote communications.",
    "description 4": "Development of secure routing protocols to protect data integrity during transmission.",
    "description 5": "Study of denial-of-service attack mitigation techniques.",
    "description 6": "Application of network segmentation to limit the spread of potential breaches.",
    "description 7": "Implementation of access control lists to restrict network resource usage.",
    "description 8": "Utilization of network monitoring tools to detect and analyze traffic anomalies.",
    "description 9": "Development of secure wireless communication protocols.",
    "description 10": "Study of network security policies and their enforcement mechanisms.",
    "id": "85"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Security in hardware",
    "description 1": "Analysis of hardware-based security modules for cryptographic operations.",
    "description 2": "Implementation of trusted execution environments to protect sensitive computations.",
    "description 3": "Development of secure boot mechanisms to ensure system integrity.",
    "description 4": "Examination of side-channel attacks and countermeasures in hardware components.",
    "description 5": "Study of hardware Trojans and their detection methods.",
    "description 6": "Utilization of physical unclonable functions for device authentication.",
    "description 7": "Design of secure integrated circuits resistant to fault injection attacks.",
    "description 8": "Investigation of hardware-based key management solutions.",
    "description 9": "Application of formal verification techniques in hardware security design.",
    "description 10": "Development of lightweight cryptographic primitives for resource-constrained devices.",
    "id": "86"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Security services",
    "description 1": "Provision of identity and access management solutions for enterprise environments.",
    "description 2": "Implementation of security information and event management systems for real-time monitoring.",
    "description 3": "Development of intrusion detection and prevention systems to safeguard networks.",
    "description 4": "Application of endpoint protection platforms to secure user devices.",
    "description 5": "Deployment of data loss prevention technologies to protect sensitive information.",
    "description 6": "Utilization of security orchestration, automation, and response tools for incident management.",
    "description 7": "Integration of threat intelligence services to enhance proactive defense strategies.",
    "description 8": "Offering managed security services to monitor and respond to security threats.",
    "description 9": "Implementation of cloud security services to protect data and applications in the cloud.",
    "description 10": "Development of compliance and governance frameworks to meet regulatory requirements.",
    "id": "87"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Software and application security",
    "description 1": "Application of static and dynamic analysis tools to identify vulnerabilities in software.",
    "description 2": "Implementation of secure coding practices to prevent common programming errors.",
    "description 3": "Development of software composition analysis tools to detect open-source vulnerabilities.",
    "description 4": "Utilization of fuzz testing techniques to uncover security flaws in applications.",
    "description 5": "Deployment of runtime application self-protection mechanisms to detect and mitigate threats.",
    "description 6": "Integration of security testing into continuous integration/continuous deployment pipelines.",
    "description 7": "Offering secure software development lifecycle services to enhance application security.",
    "description 8": "Application of threat modeling methodologies to identify and address potential security risks.",
    "description 9": "Development of security patches and updates to remediate discovered vulnerabilities.",
    "description 10": "Providing security training and awareness programs for software developers.",
    "id": "88"
  },
  {
    "1st_stage_label": "Security and privacy",
    "2nd_stage_label": "Systems security",
    "description 1": "Implementation of access control mechanisms to protect system resources.",
    "description 2": "Development of system hardening techniques to reduce attack surfaces.",
    "description 3": "Application of patch management processes to address known vulnerabilities.",
    "description 4": "Utilization of virtualization technologies to isolate and secure system components.",
    "description 5": "Deployment of system monitoring tools to detect and respond to anomalous activities.",
    "description 6": "Integration of intrusion detection systems to identify potential security breaches.",
    "description 7": "Offering system security audits to assess and improve security posture.",
    "description 8": "Development of disaster recovery and business continuity plans to ensure system resilience.",
    "description 9": "Application of encryption technologies to protect data at rest and in transit.",
    "description 10": "Providing system security training and awareness programs for administrators.",
    "id": "89"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Computational complexity and cryptography",
    "description 1": "Study of the computational hardness assumptions underlying cryptographic protocols.",
    "description 2": "Analysis of the relationship between complexity classes and cryptographic security.",
    "description 3": "Development of cryptographic primitives based on hard problems in computational complexity.",
    "description 4": "Investigation of zero-knowledge proofs and their complexity-theoretic foundations.",
    "description 5": "Exploration of the implications of quantum computing on classical cryptographic assumptions.",
    "description 6": "Application of complexity-theoretic techniques to analyze the security of cryptographic schemes.",
    "description 7": "Study of the role of randomness in cryptographic constructions and their complexity.",
    "description 8": "Development of secure multiparty computation protocols with provable complexity guarantees.",
    "description 9": "Analysis of the efficiency and security trade-offs in cryptographic algorithms.",
    "description 10": "Investigation of the complexity of cryptographic protocols in adversarial settings.",
    "id": "90"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Design and analysis of algorithms",
    "description 1": "Development of efficient algorithms for fundamental computational problems.",
    "description 2": "Analysis of algorithmic complexity and its impact on computational resources.",
    "description 3": "Application of approximation algorithms to solve NP-hard problems.",
    "description 4": "Study of randomized algorithms and their applications in optimization.",
    "description 5": "Investigation of parallel and distributed algorithms for large-scale computations.",
    "description 6": "Design of online algorithms for real-time decision-making processes.",
    "description 7": "Analysis of streaming algorithms for processing large data sets.",
    "description 8": "Development of algorithms for graph and network analysis.",
    "description 9": "Study of quantum algorithms and their potential advantages over classical counterparts.",
    "description 10": "Application of machine learning techniques to algorithm design and analysis.",
    "id": "91"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Formal languages and automata theory",
    "description 1": "Study of formal languages and their syntactic structures.",
    "description 2": "Analysis of finite automata, context-free grammars, and Turing machines.",
    "description 3": "Investigation of regular languages and context-free languages.",
    "description 4": "Examination of language recognizability and decidability.",
    "description 5": "Study of language complexity and minimization problems.",
    "description 6": "Research on state minimization and equivalence in automata.",
    "description 7": "Analysis of the computational power of Turing machines.",
    "description 8": "Application of formal languages in compiler design.",
    "description 9": "Equivalence of regular expressions and finite automata.",
    "description 10": "Parsing methods for context-free languages.",
    "id": "92"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Logic",
    "description 1": "Study of propositional and predicate logic syntax and semantics.",
    "description 2": "Analysis of completeness and consistency in logical systems.",
    "description 3": "Exploration of formal proofs and automated theorem proving.",
    "description 4": "Application of logic in program verification.",
    "description 5": "Complexity and computability in logical reasoning.",
    "description 6": "Modal and temporal logic in system specification.",
    "description 7": "Description logic in knowledge representation.",
    "description 8": "Non-classical logic systems and their properties.",
    "description 9": "Logic applications in artificial intelligence.",
    "description 10": "Relationship between logic and automata theory.",
    "id": "93"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Models of computation",
    "description 1": "Study of Turing machines, λ-calculus, and recursive functions.",
    "description 2": "Analysis of equivalence between different computational models.",
    "description 3": "Exploration of parallel and distributed computing models.",
    "description 4": "Quantum computing models and quantum Turing machines.",
    "description 5": "Computational complexity and decidability in models.",
    "description 6": "Applications of computational models in algorithm design.",
    "description 7": "Relationship between computational models and language theory.",
    "description 8": "Computational models in artificial intelligence.",
    "description 9": "Expressive power and limitations of computational models.",
    "description 10": "Evolution and development of computational models.",
    "id": "94"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Randomness, geometry and discrete structures",
    "description 1": "Study of random processes and probability theory in discrete mathematics.",
    "description 2": "Analysis of random graphs and algorithms.",
    "description 3": "Exploration of geometric structures and computational geometry.",
    "description 4": "Combinatorial optimization problems and discrete structures.",
    "description 5": "Random matrices and their properties.",
    "description 6": "Applications of random algorithms in computational geometry.",
    "description 7": "Discrete structures in computer science applications.",
    "description 8": "Role of randomness in algorithm design.",
    "description 9": "Applications of randomness in data structures.",
    "description 10": "Use of randomness in machine learning.",
    "id": "95"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Semantics and reasoning",
    "description 1": "Study of operational and axiomatic semantics in programming languages.",
    "description 2": "Logical reasoning methods in formal verification.",
    "description 3": "Computational semantics in natural language processing.",
    "description 4": "Knowledge representation using semantic networks and ontologies.",
    "description 5": "Complexity and computability in reasoning systems.",
    "description 6": "Semantic reasoning in artificial intelligence applications.",
    "description 7": "Automation and optimization in reasoning systems.",
    "description 8": "Scalability and robustness of reasoning systems.",
    "description 9": "Role of reasoning in knowledge discovery.",
    "description 10": "Integration of reasoning systems with machine learning.",
    "id": "96"
  },
  {
    "1st_stage_label": "Theory of computation",
    "2nd_stage_label": "Theory and algorithms for application domains",
    "description 1": "Development of algorithms for real-time systems to meet stringent timing constraints.",
    "description 2": "Design of algorithms for data mining tasks, such as clustering and classification.",
    "description 3": "Creation of algorithms for bioinformatics applications, including sequence alignment and gene expression analysis.",
    "description 4": "Formulation of algorithms for optimization problems in logistics and supply chain management.",
    "description 5": "Development of algorithms for computer vision tasks, such as object detection and image segmentation.",
    "description 6": "Design of algorithms for natural language processing applications, including machine translation and sentiment analysis.",
    "description 7": "Creation of algorithms for cybersecurity tasks, such as intrusion detection and cryptographic protocol analysis.",
    "description 8": "Formulation of algorithms for financial modeling and risk assessment.",
    "description 9": "Development of algorithms for social network analysis, including community detection and influence propagation.",
    "description 10": "Design of algorithms for machine learning tasks, such as supervised and unsupervised learning.",
    "id": "97"
  }
]
